import { Injectable } from "@angular/core";
import { Observable, of } from "rxjs";
import { BoomerangModel } from "./boomerang-model";

@Injectable({
    providedIn: 'root'
})  
export class ModelsService {    
    private readonly abailableModels: BoomerangModel[] = [
        {
            source: '../../assets/img/models/Kangoroo.jpg',
            name: 'Kangaroo Boomerang',
            description: 'Подходящ за деца. Начално ниво на умение за хвърляне на бумеранг с „подскачащ” добър полет полет и бавно зависващо приземяване близо до вас Обхват на полета: 10-15 м.',
            price: 10
        },
        {
            source: '../../assets/img/models/PeterPan.jpg',
            name: 'Peter Pan',
            description: 'Подходящ за деца. Начално ниво за умения при хвърляне на бумеранг с добър стандартен полет, описва висок правилен кръг. Обхват на полета: 10-15 м.',
            price: 10
        },
        {
            source: '../../assets/img/models/PositronThree.jpg',
            name: 'Позитрон 3',
            description: 'Един позитивно зареден спортен, скоростен бумеранг създаден за динамични хора!... Дълъг, атрактивен бърз полет за малките си размери, модел.  Обхват на полета: 15 - 20 м.',
            price: 15
        },
        {
            source: '../../assets/img/models/Positron.jpg',
            name: 'Позитрон',
            description: 'Един позитивно зареден спортен, скоростен бумеранг създаден за динамични хора!... Дълъг, атрактивен бърз полет за малките си размери, модел. Хвърля се и при добро въртене описва нисък скоростен  кръг  Обхват на полета: 15 - 20 м.',
            price: 15
        },
        {
            source: '../../assets/img/models/3DGoOut.jpg',
            name: '3D, излез навън',
            description: 'Забава за всички възрасти, атрактивен полет. При по-силно хвърляне може да прави обиколка и половина пред вас, преди плавно връщане, отново в ръката. Хвърля се леко, притежава надеждна ротация по-време на красивия си полет над хоризонта. Обхват на полета: 20-25 + м.',
            price: 30
        },
        {
            source: '../../assets/img/models/FireDust.jpg',
            name: 'Огнен прах',
            description: 'Бумеранг подходящ за малки и големи, млади и по-възрастни младежи, начинаещи ценители в този спорт. Моделът описва далечен, правилен кръг в пространството пред вас. Сигурно завръщане при вас след правило хвърляне!... Обхват на полета:25-30 м.+',
            price: 20
        },
        {
            source: '../../assets/img/models/Aboriginal.jpg',
            name: 'Абориген класик',
            description: 'Една класическа форма на бумеранг, описваща бавен, завладяващ полет в далечината над хоризонта пред вашия поглед!... Обхват на полета: 30-35 м.',
            price: 30
        },
        {
            source: '../../assets/img/models/BlueSpace.jpg',
            name: 'Синьо Пространство',
            description: 'Подходящ за напредващи в хвърлянето на бумеранг мъже и жени и за всеки, който обича, разстояния и обширни пространства!... Този модел се хвърля с добра скорост и правилна сила за най добри резултати, при умерен, лек ветрец!... Обхват на полета: 40-45м.+',
            price: 40
        },
        {
            source: '../../assets/img/models/SnowPeak.jpg',
            name: 'Снежен връх',
            description: 'Този бумеранг се препоръчва за опитни и напредващи любители в този спорт!... Полет, описващ дълбок елипсовиден кръг, добра височина със зависващо, бавно приземяване над вас!... Обхват на полета: 40- 45м.+',
            price: 40
        },
        {
            source: '../../assets/img/models/Symmetric.jpg',
            name: 'Симетрик',
            description: 'Скоростен бумеранг за напреднали в този спорт ценители! Бумерангът търпи и по-силно хвърляне... Има задоволителни качества на полета, височина, дълбочина и далечина над хоризонта!... Обхват на полета: 40- 45м.+',
            price: 40
        },
        {
            source: '../../assets/img/models/ForteDynamic.jpg',
            name: 'Форте Динамик бумеранг',
            description: 'Голям по площ четирираменен бумеранг, който сигурно тежи в ръката. Притежава далечен и дълбок, дълъг, атрактивен полет над хоризонта. Рамената при надеждна ротация, осигуряват плавно и нежно връщане, удобно за безопасно улавяне във въздуха. Дистанция на полета: 40 м. +',
            price: 47
        },
        {
            source: '../../assets/img/models/RoteydoBoomerang.jpg',
            name: 'Ротейдо бумеранг',
            description: 'Голямата площ и тежест на този модел, задават добри параметри на полета. Плавен, дълъг и висок полет с бавно приземяване над точката на хвърляне. Търпи различна сила на захвърляне. Най-добри резултати на голямата окръжност, която бумерангът описва над хоризонта се постигат в условията на нежен и лек ветрец. Дистанция на полета: 40-50 м.+',
            price: 50
        }
    ];  
    
    getAvailableModels(): Observable<BoomerangModel[]> {
        return of(this.abailableModels);
    }
}